{"format": "graph-model", "generatedBy": "2.18.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"args_0": {"name": "args_0:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/user_product_recommender_1/embedding_1/GatherV2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "15"}, {"size": "200"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/user_product_recommender_1/embedding_1/Less/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/user_product_recommender_1/embedding_1/strided_slice", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/user_product_recommender_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/user_product_recommender_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/user_product_recommender_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/user_product_recommender_1/embedding_1/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/user_product_recommender_1/embedding_1_2/GatherV2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "504"}, {"size": "200"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/user_product_recommender_1/embedding_1_2/Less/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/user_product_recommender_1/embedding_1_2/strided_slice", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/user_product_recommender_1/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/user_product_recommender_1/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/user_product_recommender_1/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/user_product_recommender_1/embedding_1_2/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/user_product_recommender_1/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/user_product_recommender_1/sequential_1/dense_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/user_product_recommender_1/sequential_1/dense_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/user_product_recommender_1/sequential_1/dense_1_2/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/user_product_recommender_1/sequential_1/dense_1_2/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/user_product_recommender_1/sequential_1/dense_2_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/user_product_recommender_1/sequential_1/dense_2_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "args_0", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "2"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/user_product_recommender_1/strided_slice", "op": "StridedSlice", "input": ["args_0", "StatefulPartitionedCall/user_product_recommender_1/strided_slice/stack", "StatefulPartitionedCall/user_product_recommender_1/strided_slice/stack_1", "StatefulPartitionedCall/user_product_recommender_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "2"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "end_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/user_product_recommender_1/strided_slice_1", "op": "StridedSlice", "input": ["args_0", "StatefulPartitionedCall/user_product_recommender_1/strided_slice_1/stack", "StatefulPartitionedCall/user_product_recommender_1/strided_slice_1/stack_1", "StatefulPartitionedCall/user_product_recommender_1/strided_slice_1/stack_2"], "attr": {"shrink_axis_mask": {"i": "2"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "end_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/user_product_recommender_1/embedding_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/user_product_recommender_1/strided_slice"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_INT32"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/user_product_recommender_1/embedding_1_2/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/user_product_recommender_1/strided_slice_1"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_INT32"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/user_product_recommender_1/embedding_1/Less", "op": "Less", "input": ["StatefulPartitionedCall/user_product_recommender_1/embedding_1/Cast", "StatefulPartitionedCall/user_product_recommender_1/embedding_1/Less/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/user_product_recommender_1/embedding_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/user_product_recommender_1/embedding_1/Cast", "StatefulPartitionedCall/user_product_recommender_1/embedding_1/strided_slice"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/user_product_recommender_1/embedding_1_2/Less", "op": "Less", "input": ["StatefulPartitionedCall/user_product_recommender_1/embedding_1_2/Cast", "StatefulPartitionedCall/user_product_recommender_1/embedding_1_2/Less/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/user_product_recommender_1/embedding_1_2/add", "op": "AddV2", "input": ["StatefulPartitionedCall/user_product_recommender_1/embedding_1_2/Cast", "StatefulPartitionedCall/user_product_recommender_1/embedding_1_2/strided_slice"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/user_product_recommender_1/embedding_1/SelectV2", "op": "SelectV2", "input": ["StatefulPartitionedCall/user_product_recommender_1/embedding_1/Less", "StatefulPartitionedCall/user_product_recommender_1/embedding_1/add", "StatefulPartitionedCall/user_product_recommender_1/embedding_1/Cast"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/user_product_recommender_1/embedding_1_2/SelectV2", "op": "SelectV2", "input": ["StatefulPartitionedCall/user_product_recommender_1/embedding_1_2/Less", "StatefulPartitionedCall/user_product_recommender_1/embedding_1_2/add", "StatefulPartitionedCall/user_product_recommender_1/embedding_1_2/Cast"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/user_product_recommender_1/embedding_1/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/user_product_recommender_1/embedding_1/GatherV2/ReadVariableOp", "StatefulPartitionedCall/user_product_recommender_1/embedding_1/SelectV2", "StatefulPartitionedCall/user_product_recommender_1/embedding_1/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/user_product_recommender_1/embedding_1_2/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/user_product_recommender_1/embedding_1_2/GatherV2/ReadVariableOp", "StatefulPartitionedCall/user_product_recommender_1/embedding_1_2/SelectV2", "StatefulPartitionedCall/user_product_recommender_1/embedding_1_2/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/user_product_recommender_1/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/user_product_recommender_1/embedding_1/GatherV2", "StatefulPartitionedCall/user_product_recommender_1/embedding_1_2/GatherV2", "StatefulPartitionedCall/user_product_recommender_1/concat/axis"], "attr": {"N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/user_product_recommender_1/sequential_1/dense_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/user_product_recommender_1/concat", "StatefulPartitionedCall/user_product_recommender_1/sequential_1/dense_1/Cast/ReadVariableOp", "StatefulPartitionedCall/user_product_recommender_1/sequential_1/dense_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/user_product_recommender_1/sequential_1/dense_1_2/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/user_product_recommender_1/sequential_1/dense_1/Relu", "StatefulPartitionedCall/user_product_recommender_1/sequential_1/dense_1_2/Cast/ReadVariableOp", "StatefulPartitionedCall/user_product_recommender_1/sequential_1/dense_1_2/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/user_product_recommender_1/sequential_1/dense_2_1/Add", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/user_product_recommender_1/sequential_1/dense_1_2/Relu", "StatefulPartitionedCall/user_product_recommender_1/sequential_1/dense_2_1/Cast/ReadVariableOp", "StatefulPartitionedCall/user_product_recommender_1/sequential_1/dense_2_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/user_product_recommender_1/sequential_1/dense_2_1/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1994}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/user_product_recommender_1/embedding_1/GatherV2/ReadVariableOp", "shape": [15, 200], "dtype": "float32"}, {"name": "StatefulPartitionedCall/user_product_recommender_1/embedding_1/Less/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/user_product_recommender_1/embedding_1/strided_slice", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/user_product_recommender_1/strided_slice/stack", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/user_product_recommender_1/strided_slice/stack_1", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/user_product_recommender_1/strided_slice/stack_2", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/user_product_recommender_1/embedding_1/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/user_product_recommender_1/embedding_1_2/GatherV2/ReadVariableOp", "shape": [504, 200], "dtype": "float32"}, {"name": "StatefulPartitionedCall/user_product_recommender_1/embedding_1_2/Less/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/user_product_recommender_1/embedding_1_2/strided_slice", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/user_product_recommender_1/strided_slice_1/stack", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/user_product_recommender_1/strided_slice_1/stack_1", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/user_product_recommender_1/strided_slice_1/stack_2", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/user_product_recommender_1/embedding_1_2/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/user_product_recommender_1/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/user_product_recommender_1/sequential_1/dense_1/Cast/ReadVariableOp", "shape": [400, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/user_product_recommender_1/sequential_1/dense_1/Add/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/user_product_recommender_1/sequential_1/dense_1_2/Cast/ReadVariableOp", "shape": [128, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/user_product_recommender_1/sequential_1/dense_1_2/Add/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/user_product_recommender_1/sequential_1/dense_2_1/Cast/ReadVariableOp", "shape": [64, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/user_product_recommender_1/sequential_1/dense_2_1/Add/ReadVariableOp", "shape": [1], "dtype": "float32"}]}]}